; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared1 - mode
	image3 - mode
	thermograph2 - mode
	image5 - mode
	image4 - mode
	infrared0 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	Star6 - direction
	GroundStation7 - direction
	Star1 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(supports instrument1 image5)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 thermograph2)
	(supports instrument2 image4)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
)
(:goal (and
	(have_image Phenomenon10 image5)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon11 infrared0)
	(have_image Phenomenon11 image4)
	(have_image Star12 image5)
	(have_image Phenomenon13 image4)
	(have_image Phenomenon13 thermograph2)
	(have_image Star14 image4)
	(have_image Star14 image5)
	(have_image Planet15 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation0 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 star14 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star14)
   goals met: 0 of 10
5. (take_image satellite0 star14 instrument1 image5)
   added: (have_image star14 image5)
   goals met: 1 of 10
6. (turn_to satellite0 star12 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star12)
   goals met: 1 of 10
7. (take_image satellite0 star12 instrument1 image5)
   added: (have_image star12 image5)
   goals met: 2 of 10
8. (turn_to satellite0 planet15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet15)
   goals met: 2 of 10
9. (take_image satellite0 planet15 instrument1 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon10 instrument1 image5)
   added: (have_image phenomenon10 image5)
   goals met: 4 of 10
12. (take_image satellite0 phenomenon10 instrument1 image3)
   added: (have_image phenomenon10 image3)
   goals met: 5 of 10
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 10
14. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 5 of 10
15. (turn_to satellite0 groundstation8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation8)
   goals met: 5 of 10
16. (calibrate satellite0 instrument2 groundstation8)
   added: (calibrated instrument2)
   goals met: 5 of 10
17. (turn_to satellite0 phenomenon11 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 10
18. (take_image satellite0 phenomenon11 instrument2 image4)
   added: (have_image phenomenon11 image4)
   goals met: 6 of 10
19. (take_image satellite0 phenomenon11 instrument2 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 7 of 10
20. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 7 of 10
21. (take_image satellite0 phenomenon13 instrument2 image4)
   added: (have_image phenomenon13 image4)
   goals met: 8 of 10
22. (take_image satellite0 phenomenon13 instrument2 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 9 of 10
23. (turn_to satellite0 star14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star14)
   goals met: 9 of 10
24. (take_image satellite0 star14 instrument2 image4)
   added: (have_image star14 image4)
   goals met: 10 of 10
